# Introduction to SQL

SQL is a mini language for managing data in Relational Database Management Systems (RDBMS).

Every database engine supports a slightly different flavour of SQL even though there are a lot of it common across engines. In this course, we are going to look to two database engines - _SQLite_ and _MS SQL Server_.

We'll start exploring with _SQLite_ first as it is easier to setup and run and then move on to exploring MS SQL Server.

## The Setup

To make it easier to run queries and interact with databases right from the jupyter notebook, we'll using a a [jupysql extension](https://jupysql.ploomber.io). It allows us to run queries using `%%sql` magic command. You can enable it by running the following command.

In [ ]:
%load_ext sql

Also, set the limit of number of rows to display to 25.

In [ ]:
%config SqlMagic.displaylimit = 25
%config SqlMagic.displaycon = False

We are going to use a sqlite database `trains.db` for this exploration.

In [ ]:
%sql sqlite:///trains.db

You can verify it by running the following query.

In [ ]:
%%sql
SELECT 1 as x, 2 as y

Congratulations! Your setup is ready.

You can use the same `%sql` to specify connection to a different database and `%%sql` to write a query.

## Basic Select Statement

We'll start with understanding the SELECT statement.

In this section, we'll learn:

* basic SQL statement
* selecting columns
* limiting the number of rows
* ordering the results
* count(*)
* column aliases
* count distinct values
* select distinct values

Preview of the train table.

```{python .sql}

#| classes: sql

%%sql
SELECT * FROM train
LIMIT 5
```

We can also specify which columns what we want in the result.

In [ ]:
%%sql
SELECT number, name, from_station_name, to_station_name
FROM train
LIMIT 5

### Column Alias

We can also specify an alias or a different name for a column.

```{python .sql}

#| classes: sql

%%sql
SELECT
    number as train_number,
    name as train_name,
    from_station_name as from_station,
    to_station_name as to_station
FROM train
LIMIT 5
```

### Order By

The `ORDER BY` clause is used to order the results. For example, the following query returns the first 5 trains ordered by the train number.

In [ ]:
%%sql
SELECT * FROM train
ORDER by number
LIMIT 5

The order can be reversed by specifying a suffix `DESC` to the column.

In [ ]:
%%sql
SELECT * FROM train
ORDER by number DESC
LIMIT 5

### `count(*)`

How many trains are there in total?

In [ ]:
%%sql
SELECT count(*) FROM train

We can also give a name to the column instead of showing it as `count(*)`.

In [ ]:
%%sql
SELECT count(*) AS num_trains
FROM train

### Counting Distinct Values

If you notice, there is column called `type` indicating the type of the train. How can we find how many types are there?

Will `count(type)` help? Let's see.

In [ ]:
%%sql
SELECT count(type) FROM train

That doesn't seem to be working.

Did you notice that the the count is different from `num_trains` that we got in the previous query. What could be the reason? Think about it.

That didn't work because `count` would count all the values, except when the value is `None`. We need to use `count(distinct ...)` to count distinct values in a column.

In [ ]:
%%sql
SELECT count(distinct type) FROM train

### Selecting Distinct Values

We can also use `SELECT DISTINCT` to list all the distinct values.

In [ ]:
%%sql
SELECT DISTINCT type
FROM train

### Exercises

Now it is time for some practice problems.

**Probem 1:**

Show a preview of `station` table by listing 5 rows.

**Probem 2:**

How many stations are there?

**Probem 3:**

The station table has a column `state`. Can you write a query to find the number of distinct states?

**Probem 4:**

Write a query to list all the distinct states.

**Problem 5:**

Find top-5 trains by the distance.

Hint: The `train` table has a `distance` column.

## Where Clause and Conditions

The `WHERE` clause is used to filter the result to contain only rows matching some conditions.

Let's write a query to list some trains starting from Bangalore. The station code for _Bangalore city Jn_ is `SBC`.

In [ ]:
%%sql
SELECT * FROM train
WHERE from_station_code='SBC'
LIMIT 5

We can also specify multiple conditions and join them using `AND` or `OR` clauses.

For example, let's find all the trains that start from Bangalore (`SBC`) and go to Chennai (`MAS`).

In [ ]:
%%sql
SELECT * FROM train
WHERE
    from_station_code='SBC'
    AND to_station_code='MAS'

Bangalore has one more railway station Yeswantpur (`YPR`). Let's try to update the query to consider from_station as either of these stations.

In [ ]:
%%sql
SELECT * FROM train
WHERE
    (from_station_code='SBC' OR from_station_code='YPR')
    AND to_station_code='MAS'

You can see there is one train starting from `YPR` to `MAS`.

We could also achieve the same using the `IN` clause instead of `OR`.

In [ ]:
%%sql
SELECT * FROM train
WHERE
    from_station_code IN ('SBC', 'YPR')
    AND to_station_code='MAS'

### Filtering

### Aggregation